import React, { FC } from "react";

export enum ModEnum {
  poker,
  dealer,
  none,
}

export const DescriptionMods: FC<{ mode: ModEnum }> = ({ mode }) => {
  return (
    <>
      {
        {
          [ModEnum.poker]: "Онлайн Покер - это обычный покер онлайн (но пока он не доступен, так как не сделан)",
          [ModEnum.dealer]:
            "Онлайн Дилер - это режим который позволяет вам контролировать вашу реальную игру, по сути это менеджер который позволяет заменить фишки, и упростить игру",
          [ModEnum.none]:
            "Добро пожаловать на сайт 'Kira Poker' я создал этот сайт чтоб проще было играть с друзьями, не искать нужное приложение и сайт, чтоб каждый мог взять телефон и начать играть, давайте выберем режим",
        }[mode]
      }
    </>
  );
};
